{"data":{"markdownRemark":{"html":"<p>Il est souvent difficile de tenir nos <strong>bonnes résolutions</strong> et de ne pas abandonner en cours de route. Selon diverses études, environ 80% de ces promesses ne tiennent que quelques semaines. Et si la raison de ces échecs se trouvait principalement dans notre <strong>état d'esprit</strong>?</p>\n<p>C'est en tout cas ce qu'indiquent  les recherches de la psychologue Carol Dweck. Chercheuse à l'université de Stanford, C.Dweck est connue pour son livre \"Mindset: The new psychology of success\". Un ouvrage dans lequel elle analyse la relation entre états d'esprit et chances de réussite. </p>\n<p>Et selon ses travaux, nos échecs proviennent bien souvent d'un état d'esprit négatif: <strong>l'état d'esprit fixe</strong>.</p>\n<h2 id=\"létat-desprit-fixe\"><a href=\"#l%C3%A9tat-desprit-fixe\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>L'état d'esprit fixe</h2>\n<p>Pour ceux qui se trouvent dans cet état d'esprit:</p>\n<ul>\n<li>l'intelligence et les compétences sont innées, déterminées à l'avance.</li>\n<li>la peur de l'échec est un frein empêchant de se lancer dans de nouveaux challenges.</li>\n<li>la critique et les feedbacks sont des choses à éviter.</li>\n<li>la réussite des autres est perçue comme une menace.</li>\n<li>l'abandon est une habitude</li>\n</ul>\n<p>Dans cet état d'esprit, notre <strong>peur d'échouer</strong> nous empêche de sortir de notre zone de confort. Résultat, nous nous replions sur nos acquis et nous arrêtons de progresser. Ce qui ne fait que confirmer notre vision de départ : les compétences ne sont pas le fruit du travail mais quelque chose d'innée.</p>\n<p>Un cercle vicieux dans lequel il est très facile de tomber et auquel nous sommes tous exposés de temps à autre.</p>\n<ul>\n<li><em>Je ne suis pas bon·ne en anglais.</em></li>\n<li><em>Je n'arriverai jamais à perdre ces quelques kilos en trop.</em></li>\n<li><em>Les maths, ce n'est pas pour moi</em></li>\n</ul>\n<p>\"Je suis ...\", \"Je ne suis pas ...\". Des phrases en apparence anodine mais qui contribuent à renforcer un état d'esprit fixe. <strong>En s'auto-persuadant de notre incapacité, nous construisons les barrières qui nous empêchent de progresser.</strong></p>\n<p>Des facteurs extérieurs peuvent également contribuer au développement de cet état d'esprit. La sphère familiale, l'éducation, les amis ou les collèges jouent leur rôles:</p>\n<ul>\n<li><em>Tu n'est vraiment pas doué·e pour ça.</em></li>\n<li><em>Oublie ça, ça n'est pas pour toi.</em></li>\n<li><em>Je t'ai expliqué·e cent fois, tu n'y comprends vraiment rien.</em></li>\n</ul>\n<p>Autant de phrases qui participent à :</p>\n<ul>\n<li>ancrer leur destinataire dans un état d'esprit négatif.</li>\n<li>impacter négativement la croissance de leurs compétences.</li>\n<li>augmenter leur niveau de stress.</li>\n<li>dégrader leur joie et leur santé.</li>\n</ul>\n<h2 id=\"létat-desprit-de-croissance\"><a href=\"#l%C3%A9tat-desprit-de-croissance\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>L'état d'esprit de croissance</h2>\n<p>A l'opposé, pour ceux s'épanouissant dans cet état d'esprit:</p>\n<ul>\n<li>l'intelligence et les compétences s'acquièrent au fil du temps.</li>\n<li>les nouveaux challenges sont source d'apprentissages et d'expériences.</li>\n<li>les feedbacks et la critique sont bienvenus</li>\n<li>la persévérance et la résilience sont les clés de la réussite.</li>\n<li>le succès des autres est une source d'inspiration.</li>\n</ul>\n<p>Dans cet état d'esprit, les échecs sont perçus comme des indicateurs du chemin qui reste à parcourir. Les critiques comme des moyens de progresser plus rapidement. Et nous sommes conscient·e·s que c'est par un travail régulier que nous atteindrons nos objectifs.</p>\n<p>Les bénéfices de l'état d'esprit fixe sont nombreux:</p>\n<ul>\n<li>augmentation de la confiance en soi</li>\n<li>amélioration des relations avec les autres</li>\n<li>disparition du besoin \"d'être parfait\"</li>\n<li>diminution du stress et des risques de dépression</li>\n</ul>\n<h2 id=\"passer-dun-état-desprit-fixe-à-un-état-desprit-de-croissance\"><a href=\"#passer-dun-%C3%A9tat-desprit-fixe-%C3%A0-un-%C3%A9tat-desprit-de-croissance\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Passer d'un état d'esprit fixe à un état d'esprit de croissance</h2>\n<p>La première étape est de prendre conscience que <strong>l'état d'esprit fixe ne correspond à aucune réalité scientifique</strong>. Les neurosciences ont montrées depuis longtemps que notre cerveau était en constante évolution.</p>\n<p>Ce sont les connexions neuronales qui nous permettent d'accomplir les tâches de notre quotidien. Hors celles-ci se créent par l'apprentissage et la répétition.</p>\n<p>A l'inverse, le fait de ne pas utiliser une compétence pendant une longue période cause la disparition des connections associées. C'est ainsi que par exemple:</p>\n<ul>\n<li>un·e expatrié·e de longue date aura tendance à chercher ses mots dans sa langue maternelle</li>\n<li>il est difficile de se rappeler des dates ou théorèmes que nous avons appris au collège</li>\n</ul>\n<p>Un seul domaine échappe (en partie) à cette règle: le sport de haut-niveau. Si votre objectif est de décrocher une médaille d'or au JO, avoir un talent inné dans la discipline vous sera probablement nécessaire. Mais pour le reste, <strong>le talent n'est rien de plus qu'un facilitateur</strong>. Il peut aider au début à progresser plus rapidement, mais il n'a aucun impact sur le résultat final.</p>\n<p>Une fois cette information un peu abstraite en tête, quelques conseils pratiques:</p>\n<h3 id=\"repérer-la-présence-de-létat-desprit-fixe\"><a href=\"#rep%C3%A9rer-la-pr%C3%A9sence-de-l%C3%A9tat-desprit-fixe\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Repérer la présence de l'état d'esprit fixe</h3>\n<p>Apprenez à repérer les manifestations de l'état d'esprit fixe. Qu'il vienne de votre entourage ou de vous directement. À chaque fois que vous entendez une des phrases typiques de cet état d'esprit, notez là en vous-même. Vous verrez qu'elles apparaissent plus souvent qu'on ne le pense.</p>\n<h3 id=\"décomposer-ses-objectifs\"><a href=\"#d%C3%A9composer-ses-objectifs\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Décomposer ses objectifs</h3>\n<p><strong>Lorsque vous vous fixez un objectif, décomposez le et commencez petit.</strong> Dans l'état d'esprit fixe, nous avons tendance à abandonner faute d'avoir atteint assez vite les objectifs visés. La solution se trouve dans la décomposition. Si vous voulez perdre 10kg avant l'été, commencer par quelques objectifs intermédiaires:</p>\n<ul>\n<li>janvier: supprimer le petit dessert sucré devant la TV</li>\n<li>février: janvier + courir 10 min 3 fois/semaine</li>\n<li>mars: février + manger un plat de légumes au moins 2 fois/semaine</li>\n<li>avril: mars + marcher au moins 30 min/jour</li>\n</ul>\n<p>Cette décomposition permettra aux habitudes de s'ancrer naturellement. Et de booster votre confiance en vous à chaque objectif atteint. Au bout de quelques semaines, le premier micro-objectif se sera transformé en habitude. Et la tâche qui lui est associée ne vous demandera plus le moindre effort.</p>\n<h3 id=\"vous-êtes-ce-que-vous-faites\"><a href=\"#vous-%C3%AAtes-ce-que-vous-faites\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Vous êtes ce que vous faites</h3>\n<p><em>L’homme n’est rien d’autre que la série de ses actes.  - Hegel -</em></p>\n<p>Il n'existe qu'un seul et unique moyen de changer la perception que vous avez de vous-même: <strong>devenir celui ou celle que vous voulez être</strong>. Et là encore, le moyen le plus simple d'y parvenir passe par la répétition de petites actions.</p>\n<p>Vous voulez parler anglais? Commencer dès aujourd'hui et fixer vous un objectif minime. Apprendre 5 mots par jour par exemple.</p>\n<p>2000, c'est la moyenne du nombre de mots nécessaire pour être capable de tenir une conversation dans une langue étrangère.</p>\n<p>2000 / 5 = 400. En 400 jours, vous aurez acquis le vocabulaire suffisant pour vous débrouiller dans la plupart des situations. 400 jours, ça n'est pas si long finalement. Tout ça en se limitant à 5 nouveaux mots par jour.</p>\n<p>Vous voulez commencer le jogging? Commencer par quelques minutes une ou deux fois par semaine. Puis, quand vous vous sentirez prêt·e, augmenter la durée ou la fréquence de vos courses. </p>\n<p>Au bout de quelques mois, vous pourrez sans doute courir ces 10km qui semblent terrifiants aujourd'hui. Au bout d'un an, vous serez prêt·e pour courir un marathon.</p>\n<p>Plus important encore que l'objectif final, cette pratique régulière permet deux choses:</p>\n<ul>\n<li>de vous concentrer sur le processus et non sur le résultat.</li>\n<li>de changer progressivement la perception que vous avez de vous-même. Rapidement, vous ne vous direz plus \"Je ne sais pas...\" mais \"J'apprends à...\".</li>\n</ul>\n<h3 id=\"concentrer-vous-sur-le-processus-pas-sur-le-résultat\"><a href=\"#concentrer-vous-sur-le-processus-pas-sur-le-r%C3%A9sultat\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Concentrer vous sur le processus, pas sur le résultat</h3>\n<p>Lorsque nous nous lançons dans un challenge, nous avons tendance à nous concentrer sur le résultat. Logique, puisqu'il est la source de notre motivation d'origine. Mais au cours de l'apprentissage d'une pratique, il est bien plus important de se concentrer sur le processus en lui-même. Cela permet d'éviter la frustration de ne pas voir les choses avancer assez vite.</p>\n<p><strong>Au lieu de mesurer combien vous êtes loin du résultat final, mesurez vos progrès et planifiez votre lendemain.</strong> À force de pratique et de constance, le résultat arrivera sans même que vous ne vous en rendiez compte.</p>\n<h3 id=\"changer-votre-perception-des-choses\"><a href=\"#changer-votre-perception-des-choses\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Changer votre perception des choses</h3>\n<p>Vous l'aurez compris, bon nombre de blocages viennent en majorité de l'intérieur même de notre cerveau. Et de la façon dont nous nous percevons. </p>\n<p>La pratique régulière et l'accomplissement de petits objectifs boostent notre confiance en nous. (Ou la confiance en soi) À force de chausser ses baskets deux fois par semaine, ou d'ouvrir son appli de vocabulaire chaque jour, on modifie notre regard sur nous-même.</p>\n<p>Les petites victoires du quotidien nous libèrent peu à peu de l'état d'esprit fixe. Et nous prouvent que quoi qu'on puisse en penser, nous sommes tout à fait capable d'atteindre nos objectifs.</p>\n<p>Pour conclure, une citation de Lao-Tseu, parfaitement adaptée ici:</p>\n<p><em>Un voyage de mille lieus commence toujours par un premier pas.</em></p>\n<p>Et vous, quel va être votre premier pas vers <strong>l'esprit de croissance</strong> ?</p>","timeToRead":7,"excerpt":"Il est souvent difficile de tenir nos  bonnes résolutions  et de ne pas abandonner en cours de route. Selon diverses études, environ 80% de…","frontmatter":{"title":"État d'esprit fixe et état d'esprit de croissance","cover":"/img/posts_cover/mindset.jpg","date":"2019/04/04","category":"developpement","tags":["DEVELOPPEMENT PERSONNEL"],"description":"Nos vies sont régies par nos état d'esprit. Passer d'un état d'esprit fixe à un état d'esprit de croissance peut faire une grande difference"},"fields":{"nextTitle":"Chaque jour est un nouveau départ","nextSlug":"/chaque-jour-est-un-nouveau-depart","prevTitle":"Résoudre ses problèmes grâce à la méthode des 5 pourquoi","prevSlug":"/methode-des-cinq-pourquoi","slug":"/etat-esprit-fixe-etat-esprit-croissance","date":"2019-04-03T22:00:00.000Z"}}},"pageContext":{"slug":"/etat-esprit-fixe-etat-esprit-croissance"}}