{"data":{"markdownRemark":{"html":"<p>Le stress, peut-être l'un des plus grands maux de notre temps. Dans une société où les choses vont à 100 à l'heure et où l'on est en permanence sollicité, il est difficile d'y échapper.</p>\n<p>Burn-out, insomnies, dépression, les maux causés par cet ennuyeux compagnon sont nombreux. Et nous sommes tous, d'une façon ou d'une autre, confrontés à ces méfaits.\nPourtant, <strong>le stress n'est pas mauvais en soi</strong>. C'est un mécanisme de survie, qui nous permet de nous adapter aux situations de danger. Si l'être humain est toujours là aujourd'hui, c'est sans doute grâce à lui.</p>\n<p>A petite dose, son action est même tout à fait bénéfique, puisqu'il nous permet de repousser nos limites. Mais libérons le de toute chaînes et il transformera notre vie en enfer. <strong>Avec le stress, tout est donc question de mesure</strong>.</p>\n<p>Mais qu'est-ce que le stress exactement ? D'où vient-il ? Et comment fonctionne t'il vraiment ?</p>\n<h2 id=\"les-différentes-étapes-du-stress\"><a href=\"#les-diff%C3%A9rentes-%C3%A9tapes-du-stress\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Les différentes étapes du stress</h2>\n<p>Lorsque vous êtes face à une situation stressante, votre corps se retrouve dans un état de choc. Pendant un moment, l'équilibre entier de votre organisme se retrouve bouleversé. Et vous basculez dans un état de vulnérabilité avancé.</p>\n<h3 id=\"phase-1--la-phase-dalarme\"><a href=\"#phase-1--la-phase-dalarme\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Phase 1 : la phase d'alarme</h3>\n<p>C'est là que votre cerveau entre en jeu. Voyant que votre corps est dans une situation précaire, il prend les choses en main. En stimulant vos glandes surrénales, il provoque la libération d'adrénaline et de noradrénaline.</p>\n<p>Cette libération augmente temporairement vos capacités . Accélération du rythme cardiaque, amélioration des réflexes, mémoire boostée... Pour faire face à la situation, vous consommez votre stock d'énergie. Une consommation qui vous transforme quelques temps en une sorte de <em>super-vous</em>. Votre corps est en alerte maximale, prêt à faire face au danger. C'est la <strong>phase d'alarme</strong>.</p>\n<p>Une fois cette phase de choc passée, le corps tente de reprendre son fonctionnement habituel. Hors, si la situation stressante est toujours là, il va falloir qu'il s'y adapte.</p>\n<h3 id=\"phase-2-la-phase-de-résistance\"><a href=\"#phase-2-la-phase-de-r%C3%A9sistance\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Phase 2: la phase de résistance</h3>\n<p>Pour ce faire, il entre dans sa seconde phase, <strong>la phase de résistance</strong>. Et une nouvelle hormone fait son entrée: le cortisol. En stimulant la production de glucose, le cortisol permet à votre corps de se régénérer en énergie. Énergie que votre corps va se charger de distribuer aux endroits nécessaires.</p>\n<p>Si vous avez besoin de courir, vos jambes recevront un surplus. Si vous avez besoin de soulever une charge lourde, ce sont vos bras qui en bénéficieront…</p>\n<p>Tout le monde connaît l'expression \"La peur donne des ailes\". Pour être plus précis, ces ailes nous sont fournies par ce fameux cortisol.</p>\n<h4 id=\"limportance-du-cortisol\"><a href=\"#limportance-du-cortisol\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>L'importance du cortisol</h4>\n<p>Le cortisol est un élément essentiel de notre corps. En maintenant son équilibre énergétique, il vous permet de faire face aux situations du quotidien. Il agit également comme régulateur du sommeil ou de la tension artérielle.</p>\n<p>Une importance qu'a bien compris votre cerveau: afin que le cortisol, produit dans la région des reins, ait un accès rapide à vos réserves d'énergie, votre corps stocke celle-ci au plus proche. C'est la raison pour laquelle, lorsque vous êtes soumis à un stress régulier, vous avez tendance à accumuler les graisses autour de la taille.</p>\n<p>Lorsque la situation stressante est passée, votre corps doit retrouver son équilibre. Vous avez mobilisé énormément de ressources pour vaincre le danger. Vous avez donc besoin de recharger les batteries.</p>\n<p>Et pour ça, votre corps va se charger de vous envoyer quelques signaux. Signal de la faim, fatigue... C'est pourquoi après un coup de stress, vous ressentez le besoin de vous asseoir ou de grignoter.</p>\n<h3 id=\"phase-3-la-phase-dépuisement\"><a href=\"#phase-3-la-phase-d%C3%A9puisement\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Phase 3: la phase d'épuisement</h3>\n<p>Mais si la phase de résistance se prolonge, votre corps entre dans sa troisième et dernière phase. La <strong>phase d'épuisement</strong>.</p>\n<p>Dans cette phase, votre corps est dépassé et ne parvient plus à gérer le volume de stress auquel il doit faire face. N'étant plus en mesure de réguler le niveau de cortisol produit, votre cerveau se retrouve submergé. Et si le cortisol est un allié dans la vie quotidienne, il a besoin d'être contrôlé.</p>\n<p>Devant le manque d'énergie disponible pour continuer à faire face, votre corps se met en \" Ayant épuisé vos réserves de neuro-messagers, votre volonté s'amoindrie.\nVos forces diminuent. Et vous avez de plus en plus de difficultés à maintenir la lutte.”</p>\n<p>De ce fait, cette phase est particulièrement propice au développement de pathologies diverses:</p>\n<ul>\n<li>Insomnies ou troubles du sommeils</li>\n<li>Épuisement physique et/ou mental</li>\n<li>Hypertension artérielle</li>\n<li>Dépression et burn-out</li>\n<li>Diabète</li>\n<li>Ulcères</li>\n<li>Infections virales et bactériennes</li>\n<li>Troubles de la digestion</li>\n<li>...</li>\n</ul>\n<p>L'avantage, c'est que cette phase n'est pas automatique. Dans bien des cas, la phase de résistance aura suffi à venir à bout du déclencheur. Votre corps se contentera alors de passer dans une phase de lente récupération.</p>\n<h2 id=\"conclusion\"><a href=\"#conclusion\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Conclusion</h2>\n<p><strong>Le stress est un indissociable de notre vie</strong>. Il est impossible de le faire disparaître totalement. De plus, nous sommes tous différents et chacun gère le stress de façon différente.</p>\n<p>L'important est de mettre en oeuvre les solutions pour ne pas le laisser prendre le contrôle de nos vies.</p>\n<p>Le stress est avant tout une question de perception. <strong>Une perception sur laquelle il nous est possible d'agir</strong>. Souvenez-vous que le stress n'est qu'une réponse de notre corps à une situation qu'il considère comme anormale.</p>\n<p>En premier lieu, demandons nous s'il nous est possible de changer cette situation.\nSi les embouteillages du matin sont une source de stress, pouvez-vous essayez de les éviter ? En prenant les transports en commun par exemple ? </p>\n<p>En second lieu, si la situation ne peut être évitée, tentons de changer la perception que l'on a d'elle. Pourquoi ne pas prendre le temps d'écouter vos albums préférés dans les embouteillages ? Ou de planifier votre journée ? Cette situation, initialement stressante, pourrait bien devenir un moment agréable.</p>\n<p><strong>La clé se trouve dans la façon dont nous percevons le monde qui nous entoure</strong>. En nous forçant à changer cette perception, nous <strong>reprenons le contrôle sur notre stress</strong>. Et nous gagnons le pouvoir d'utiliser le stress comme un allié. Alors, pourquoi ne pas essayer ?</p>\n<p>Et vous, quel rôle joue le stress dans votre vie ? Est-il sous contrôle ? A-t-il pris l'ascendant sur votre vie ? Que pouvez-vous faire dès aujourd'hui pour lui redonner la place qui lui convient?</p>","timeToRead":5,"excerpt":"Le stress, peut-être l'un des plus grands maux de notre temps. Dans une société où les choses vont à 100 à l'heure et où l'on est en…","frontmatter":{"title":"Comment fonctionne le stress","cover":"/img/posts_cover/comment_fonctionne_le_stress.jpg","date":"2019/03/25","category":"developpement","tags":["DEVELOPPEMENT PERSONNEL"],"description":"Découvrir comment fonctionne le stress est une étape essentielle pour parvenir à le dominer. Dans cet article, vous découvrirez les différentes phases qui le compose et comment utilisez ces informations pour reprendre le contrôle sur votre vie."},"fields":{"nextTitle":"Résoudre ses problèmes grâce à la méthode des 5 pourquoi","nextSlug":"/methode-des-cinq-pourquoi","prevTitle":"Chaque jour est un nouveau départ","prevSlug":"/chaque-jour-est-un-nouveau-depart","slug":"/comment-fonctionne-le-stress","date":"2019-03-24T23:00:00.000Z"}}},"pageContext":{"slug":"/comment-fonctionne-le-stress"}}