{"data":{"allMarkdownRemark":{"edges":[{"node":{"fields":{"slug":"/pensez-comme-un-developpeur","date":"2019-04-10T22:00:00.000Z"},"excerpt":"Il y a quelques années, alors que j'étais à la recherche d'un sens à ma vie, je me suis lancé dans le développement web.  Pourtant les…","timeToRead":5,"frontmatter":{"title":"Pour résoudre vos problèmes, pensez comme un développeur","tags":["DEVELOPPEMENT PERSONNEL"],"cover":"/img/posts_cover/dev.jpg","date":"2019/04/11","category":"developpement","description":"Pour résoudre un problème, pourquoi ne pas tenter une approche logique, systématique et itérative. Cette approche est celle des développeurs"}}},{"node":{"fields":{"slug":"/etat-esprit-fixe-etat-esprit-croissance","date":"2019-04-03T22:00:00.000Z"},"excerpt":"Il est souvent difficile de tenir nos  bonnes résolutions  et de ne pas abandonner en cours de route. Selon diverses études, environ 80% de…","timeToRead":7,"frontmatter":{"title":"État d'esprit fixe et état d'esprit de croissance","tags":["DEVELOPPEMENT PERSONNEL"],"cover":"/img/posts_cover/mindset.jpg","date":"2019/04/04","category":"developpement","description":"Nos vies sont régies par nos état d'esprit. Passer d'un état d'esprit fixe à un état d'esprit de croissance peut faire une grande difference"}}},{"node":{"fields":{"slug":"/chaque-jour-est-un-nouveau-depart","date":"2019-03-31T22:00:00.000Z"},"excerpt":"Certaines journées sont difficiles et ne semblent jamais vouloir se terminer.  D'autres, au contraire, filent sans que l'on s'en aperçoive…","timeToRead":2,"frontmatter":{"title":"Chaque jour est un nouveau départ","tags":["DEVELOPPEMENT PERSONNEL"],"cover":"/img/posts_cover/new_day.jpg","date":"2019/04/01","category":"developpement","description":"Quelle que soit la tournure qu'a pris le cours de votre vie, ou les difficultés rencontrées, aujourd'hui porte en lui les germes d'une grande journée."}}},{"node":{"fields":{"slug":"/comment-fonctionne-le-stress","date":"2019-03-24T23:00:00.000Z"},"excerpt":"Le stress, peut-être l'un des plus grands maux de notre temps. Dans une société où les choses vont à 100 à l'heure et où l'on est en…","timeToRead":5,"frontmatter":{"title":"Comment fonctionne le stress","tags":["DEVELOPPEMENT PERSONNEL"],"cover":"/img/posts_cover/comment_fonctionne_le_stress.jpg","date":"2019/03/25","category":"developpement","description":"Découvrir comment fonctionne le stress est une étape essentielle pour parvenir à le dominer. Dans cet article, vous découvrirez les différentes phases qui le compose et comment utilisez ces informations pour reprendre le contrôle sur votre vie."}}},{"node":{"fields":{"slug":"/methode-des-cinq-pourquoi","date":"2019-03-19T23:00:00.000Z"},"excerpt":"Nos vies sont pleines de problèmes.  Petits problèmes du quotidien ou gros soucis qui semblent insurmontables, nous devons tous, chaque jour…","timeToRead":4,"frontmatter":{"title":"Résoudre ses problèmes grâce à la méthode des 5 pourquoi","tags":["DEVELOPPEMENT PERSONNEL"],"cover":"/img/posts_cover/five_why.jpg","date":"2019/03/20","category":"developpement","description":"Vous souhaitez régler un problème mais vous ne savez pas par où commencer. Découvrez la méthode des cinq pourquoi, un outil simple pour vous aider à découvrir la source d'un problème."}}}]}},"pageContext":{}}