{"data":{"markdownRemark":{"html":"<p>Il y a quelques années, alors que j'étais à la recherche d'un sens à ma vie, je me suis lancé dans le développement web. </p>\n<p>Pourtant les domaines scientifiques n'ont jamais été ma tasse de thé. Malgré tout, avec l'aide de quelques ressources trouvées sur internet, d'une bonne dose de temps et de quelques efforts, j'ai appris à designer et coder des sites web. </p>\n<p>Mais plus important encore, j'ai acquis une des compétences les plus utiles qui soit. Une compétence dont je me sers au quotidien: j'ai appris à <strong>penser comme un développeur</strong>. </p>\n<h2 id=\"approcher-un-problème-avec-méthode\"><a href=\"#approcher-un-probl%C3%A8me-avec-m%C3%A9thode\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Approcher un problème avec méthode</h2>\n<p>La vie est faite d'obstacles. Inlassablement, ils se dressent face à nous et nous devons les surmonter. </p>\n<p>Or, le problème avec les obstacles, c'est que nous avons souvent tendance de nous y lancer tête baissée au lieu de prendre le temps de les analyser. Pressés de les faire disparaître, nous nous y attaquons aussitôt qu'ils apparaissent, en n'ayant qu'une vague idée de la manière de procéder.</p>\n<p>En clair, nous réagissons, guidé·e·s par nos émotions, au lieu d'approcher le problème de manière rationnelle. Nous nous attaquons au problème global au lieu de le découper en petites tranches facilement solutionnables. Et nous progressons, un peu au hasard, au lieu de prendre le temps de ralentir pour vérifier notre trajectoire.</p>\n<p><strong>Pensée rationnelle, découpage du problème et correction de la trajectoire: c'est ce que j'appelle penser comme un développeur.</strong></p>\n<h2 id=\"comprendre-le-problème-cest-le-résoudre-à-moitié\"><a href=\"#comprendre-le-probl%C3%A8me-cest-le-r%C3%A9soudre-%C3%A0-moiti%C3%A9\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Comprendre le problème, c'est le résoudre à moitié</h2>\n<p><strong>Il est impossible de régler un problème que l'on ne comprend pas.</strong> C'est pourquoi il est important de commencer par une petite phase de réflexion.</p>\n<p>Imaginez un développeur à qui l'on confie un nouveau projet. Par quoi va-t-il commencer ? Probablement par analyser la situation et définir les grandes lignes du projet en question.</p>\n<p>Pour résoudre un problème, il est toujours bon de commencer par se poser quelques questions:</p>\n<ul>\n<li>Quel est votre objectif final ? Quel problème chercher vous à régler ? </li>\n<li>De quelles ressources avez-vous besoin pour parvenir à vos fins ?</li>\n<li>Quelles difficultés pensez-vous rencontrer au cours du processus ? Y'a t-il un moyen de les éviter ? Et sinon, comment allez-vous y faire face ?</li>\n</ul>\n<p>Pendant cette phase de préparation, laissez les idées affluer et notez-les sans les juger. N'hésitez pas à creuser en profondeur pour acquérir une compréhension profonde du problème qui vous occupe. </p>\n<p><strong>Plus vous le comprendrez, plus il sera facile de le résoudre ensuite.</strong></p>\n<p>Si vous avez des difficultés à identifier les réelles causes du problème, c'est le moment idéal pour tenter d'appliquer la <a href=\"https://www.kurinsu.com/methode-des-cinq-pourquoi\">méthode des cinq pourquoi</a>.</p>\n<h2 id=\"le-plan-est-votre-meilleur-allié\"><a href=\"#le-plan-est-votre-meilleur-alli%C3%A9\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Le plan est votre meilleur allié</h2>\n<p>Une fois le problème défini, il est temps de mettre de l'ordre dans tout ça. </p>\n<p>Ici, l'objectif est simple: <strong>définir votre plan d'action</strong>. </p>\n<p>Pour cela, la première étape va être de découper votre problème en <strong>sous-problèmes, plus facile à régler</strong>. </p>\n<p>Au fond, un grand problème n'est qu'une superposition de problèmes plus petits.</p>\n<p>Cette décomposition comporte un énorme avantage: <strong>vous offrir des récompenses régulières</strong> et adaptées aux efforts fournis. En effet, chaque sous-problème résolu constitue un pas de plus vers la victoire finale, et contribue à garder votre motivation intacte. </p>\n<p>Une fois votre décomposition en problèmes plus petits achevée, essayez de définir les actions nécessaires à leurs résolutions. Pour chaque sous-problème, fixez également une récompense proportionnelle à l'effort demandé. </p>\n<p>Une fois ceci fait, bravo, vous venez de dresser votre plan. L'allié indispensable à toute réussite.</p>\n<p>Une fois le cadre définit, il est temps de passer à la phase d'action.</p>\n<h2 id=\"la-phase-daction\"><a href=\"#la-phase-daction\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>La phase d'action</h2>\n<p>Durant cette phase, l'objectif est simple: mobiliser ses compétences en suivant votre plan pour obtenir un premier résultat acceptable. Une sorte de \"prototype\" si vous préférez.</p>\n<p>Lorsque vous rencontrerez des difficultés (et il y en aura forcément), deux solutions: </p>\n<ol>\n<li>Elles étaient attendues et il n'y a qu'à reprendre le cahier des charges pour voir quelles solutions vous aviez imaginé.</li>\n<li>Elles étaient imprévues, et dans ce cas, c'est le moment de faire un break pour reprendre le processus de brainstorming.</li>\n</ol>\n<p>Pendant cette phase, il peut également être intéressant de faire des <strong>points réguliers sur vos avancées</strong>. Chaque Week-end par exemple, prenez quelques minutes pour mesurer vos progrès et pour analyser votre parcours. Qu'avez-vous accompli ? Quelles difficultés avez-vous rencontrées? Quelles solutions avez-vous trouvées ? </p>\n<p>Ces moments de réflexion vous permettront de garder un certain recul, et de réajuster votre plan au besoin. Il y a en effet de forte chance que celui-ci ne soit pas parfaitement adapté à la réalité. C'est normal et ce n'est pas un problème. Si vous réalisez que des changements sont nécessaires, intégrez-les à votre plan. <strong>Celui-ci n'est qu'un guide, et un guide malléable que l'on peut tout à fait ajuster au fil du temps.</strong></p>\n<p>Une fois ce cycle actions/réflexions terminé, vous devriez avoir réglé en partie votre problème de départ, mais le travail n'est pas fini pour autant. Souvenez-vous que l'objectif n'était que de construire un \"prototype\" de résultat, il est temps de passer à la dernière phase, la phase d'itération. Mais avant, rien de mieux qu'un petit bilan.</p>\n<h2 id=\"regardez-en-arrière-pour-apprendre-de-ses-erreurs\"><a href=\"#regardez-en-arri%C3%A8re-pour-apprendre-de-ses-erreurs\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Regardez en arrière pour apprendre de ses erreurs</h2>\n<p>Ça y est, la solution prototype est en place. Il est temps de faire un premier vrai bilan. </p>\n<p>Après avoir vérifié que les choses correspondent bien au résultat attendu, <strong>prenez un moment pour analyser le chemin parcouru</strong>. À la manière des réflexions régulières que vous avez menés pendant la phase d'action, accordez-vous du temps pour répondre aux questions suivantes:</p>\n<ul>\n<li>Qu'avez-vous appris durant cette expérience?</li>\n<li>Quelles ont été les moments difficiles ? Quelles sont les lacunes que vous avez identifiées ?</li>\n<li>Quels sont les aspects que vous pourriez améliorer ?</li>\n</ul>\n<p><strong>Cette phase est peut-être la plus importante de toute, puisqu'elle permet de prendre du recul sur ce que vous avez accompli.</strong> Les journées passant, nous avons tendance à oublier nos victoires. Or, ce sont des sources de satisfaction intense. S'auto-congratuler de temps à autre peut être très bénéfique (sans tomber dans une autosatisfaction de tous les instants évidemment).</p>\n<p><strong><em>Et n'oubliez pas de vous récompenser!</em></strong> </p>\n<h2 id=\"tout-est-une-question-ditération\"><a href=\"#tout-est-une-question-dit%C3%A9ration\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Tout est une question d'itération</h2>\n<p>Dans cette ultime phase, dont le temps peut varier, l'objectif va être d'améliorer votre \"prototype\" par <strong>incrémentation</strong> jusqu'à obtenir le résultat souhaité.</p>\n<p>Pour ce faire, reprenez la partie \"améliorations possibles\" de votre bilan, et recommencez chaque étape. </p>\n<p>Pour chaque amélioration, prenez un moment de réflexion pour définir vos besoins, dressez un nouveau mini-plan (ou complétez le plan général) et repassez par la boucle d'actions/réflexions jusqu'à avoir un résultat correct. </p>\n<p>Ce nouveau cycle achevé, il est alors temps de passer à un nouveau bilan. Si vous estimez que votre problème est réglé, bravo, vous avez réussi. Ne reste plus qu'à vous offrir une jolie récompense \"finale\" pour vos efforts et de profiter de ce moment. Sinon, vous voilà parti pour un nouveau cycle d'itération, et ce jusqu'à obtenir un résultat correspondant à vos attentes.</p>\n<p>Alors</p>","timeToRead":5,"excerpt":"Il y a quelques années, alors que j'étais à la recherche d'un sens à ma vie, je me suis lancé dans le développement web.  Pourtant les…","frontmatter":{"title":"Pour résoudre vos problèmes, pensez comme un développeur","cover":"/img/posts_cover/dev.jpg","date":"2019/04/11","category":"developpement","tags":["DEVELOPPEMENT PERSONNEL"],"description":"Pour résoudre un problème, pourquoi ne pas tenter une approche logique, systématique et itérative. Cette approche est celle des développeurs"},"fields":{"nextTitle":"Pour résoudre vos problèmes, pensez comme un développeur","nextSlug":"/pensez-comme-un-developpeur","prevTitle":"Pour résoudre vos problèmes, pensez comme un développeur","prevSlug":"/pensez-comme-un-developpeur","slug":"/pensez-comme-un-developpeur","date":"2019-04-10T22:00:00.000Z"}}},"pageContext":{"slug":"/pensez-comme-un-developpeur"}}