{"data":{"markdownRemark":{"html":"<p>Certaines journées sont difficiles et ne semblent jamais vouloir se terminer. </p>\n<p>D'autres, au contraire, filent sans que l'on s'en aperçoive alors que l'on souhaiterait pouvoir les prolonger. </p>\n<p>Parfois, vous vous réveillez plein·e d' entrain, prêt·e à conquérir le monde qui s'offre à vous. Et parfois, vous n'avez qu'une seule envie, repousser de quelques minutes le fatidique moment obligatoire qui vous obligera à vous lever.</p>\n<p>Chaque jour est différent. Mais ils partagent tous une caractéristique commune: ils sont porteur d'opportunités. </p>\n<p>Quelle que soit la tournure qu'a pris votre journée, quelles que soient les difficultés rencontrées ou votre humeur du moment, <strong>aujourd'hui  porte en lui les germes d'une grande journée</strong>. </p>\n<p>Lorsque les choses se sont mal engagées, nous avons tendance à reporter nos actions et nos espoirs vers un futur idéalisé. </p>\n<p>Aujourd'hui est une mauvaise journée, ça ira mieux demain. Mais quelles garanties avons-nous donc de l'existence de cet hypothétique <em>demain</em>. </p>\n<p>Demain n'existe pas encore, et pour des milliers de personnes sur cette Terre, demain n'existera jamais. Plus de 150 000 personnes meurent chaque jour, et rien ne nous assure de ne pas faire partie de la prochaine tournée. </p>\n<p>Sans pour autant vivre dans la crainte d'une mort imminente, garder à l'esprit qu'aujourd'hui est un nouveau cadeau que nous offre la vie me semble une bonne idée. Et pour la remercier de ce présent, il n'y a rien de plus à faire que d'en profiter. Car un jour ou l'autre, pour vous comme pour moi, ce présent quotidien, auquel on a fini par s'habituer, s'évanouira pour de bon.</p>\n<p>Chaque jour est un nouveau départ, et l'opportunité nouvelle de construire votre journée idéale. Bien sûr, certains jours seront meilleurs que d'autres. Parfois, des problèmes imprévus surviendront. Mais s'il y a une chose que l'on peut faire chaque jour, quel qu'il soit, c'est de donner le meilleur de nous même dans chacune de nos actions (sans chercher pour autant une perfection illusoire). En se comportant ainsi, nous nous garantissons l'agréable satisfaction d'avoir vécu pleinement. </p>\n<p>Lorsque vous ouvrez les yeux pour la première fois du jour, soyez optimiste. Et pensez à la chance que vous avez de vous réveiller aujourd'hui. Au fil de la journée, gardez en vous cette pensée. Vous êtes en vie aujourd'hui. Profitez-en. Et si les choses tournent mal, si la déprime, la fatigue, les problèmes tendent à vous submerger, n'oubliez pas qu'aujourd'hui est un présent, qu'il n'y aura peut être pas de demain et que cette journée peut être l'une des plus mémorables de votre vie. Alors, autant la vivre pleinement !</p>\n<p>Alors dites-moi, qu'allez vous entreprendre aujourd'hui pour faire d'aujourd'hui une journée mémorable ?</p>","timeToRead":2,"excerpt":"Certaines journées sont difficiles et ne semblent jamais vouloir se terminer.  D'autres, au contraire, filent sans que l'on s'en aperçoive…","frontmatter":{"title":"Chaque jour est un nouveau départ","cover":"/img/posts_cover/new_day.jpg","date":"2019/04/01","category":"developpement","tags":["DEVELOPPEMENT PERSONNEL"],"description":"Vous souhaitez régler un problème mais vous ne savez pas par où commencer. Découvrez la méthode des cinq pourquoi, un outil simple pour vous aider à découvrir la source d'un problème."},"fields":{"nextTitle":null,"nextSlug":null,"prevTitle":null,"prevSlug":null,"slug":"/chaque-jour-est-un-nouveau-depart","date":"2019-03-31T22:00:00.000Z"}}},"pageContext":{"slug":"/chaque-jour-est-un-nouveau-depart"}}